cask_args appdir: "/Applications"

# FISH!
brew "fish"

# Core utils
brew "coreutils"
brew "git"
brew "gnupg"
brew "pinentry-mac"
brew "awscli"
brew "jq"
brew "curl"
brew "wget"
brew "httpie"
brew "readline"

# Language stuff
brew "rbenv"
brew "rbenv-default-gems"
brew "ruby-build"
brew "go"
brew "python"
brew "node"
brew "yarn"

# Shell utilities
brew "prettyping"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "starship"

# Personal Stuff
brew "youtube-dl"
brew "flac"
brew "libdvdread"
brew "mkvtoolnix"
brew "ffmpeg"

# MacOS Apps
#cask "1password"
#cask "1password-cli"
cask "visual-studio-code"
cask "encryptme"
cask "viscosity"
cask "makemkv"
cask "firefox"
cask "rectangle"
cask "github"
cask "google-cloud-sdk"
cask "signal"
cask "xld"
cask "rocket"
cask "discord"

# Fonts
tap "homebrew/cask-fonts"

cask "font-mononoki-nerd-font"
